Autodesk.Revit.DB.Toposolid.Simplify(System.Double)
Simplifies the toposolid by reducing the number of inner vertices to the given percentage.
Remarks:
At low percentages, the inner vertices may not be reduced to the exact percentage to keep a rough semblance of the original shape.
Call this method again if you want to keep removing inner vertices.
percentage:
The ratio of the number of inner vertices after simplify to the original number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input percentage should be greater than 0 and less than 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2024

Autodesk.Revit.DB.Toposolid.Split(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Split the toposolid by the given curve loops.
splitCurveLoops:
An array of planar curve loops that are used to split the toposolid.
All of the curve loops should lie on the sketch plane of the toposolid.
Returns:
An array of newly created toposolid ids after split.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The split curve loops should all lie on the sketch plane of the toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.GetSubDivisionIds
Get all element ids of toposolid subdivisions with the current toposolid as its host.
Returns:
The array of toposolid subdivision ids.
Since:
2024

Autodesk.Revit.DB.Toposolid.CreateSubDivision(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Create a toposolid subdivision element with the current toposolid as its host.
document:
The document in which the new toposolid is created.
profiles:
An array of planar curve loops that represent the profiles of the toposolid.
Returns:
The toposolid subdivision object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.GetSlabShapeEditor
Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid.
Returns:
The SlabShapeEditor object
Since:
2024

Autodesk.Revit.DB.Toposolid.CreateFromTopographySurface(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a toposolid element from a host TopographySurface, and toposolid sub-divisions from its subregions.
document:
The document in which the new toposolid is created.
hostSurfaceId:
Id of the host TopogarphySurface element.
topoTypeId:
Id of the toposolid type to be used by the new toposolid.
levelId:
Id of the level on which the toposolid is to be placed.
Returns:
A new toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of toposolid within the project.
document:
The document in which the new toposolid is created.
profiles:
An array of planar curve loops that represent the profiles of the toposolid.
points:
An array of points that used to construct the top face of the toposolid.
topoTypeId:
Id of the toposolid type to be used by the new toposolid.
levelId:
Id of the level on which the toposolid is to be placed.
Returns:
A new toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
The input point array size is less than 3.
-or-
The ElementId levelId is not a Level.
-or-
Toposolid type is not valid for this toposolid.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024

Autodesk.Revit.DB.Toposolid.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of toposolid within the project.
document:
The document in which the new toposolid is created.
points:
An array of points that used to construct the top face of the toposolid.
topoTypeId:
Id of the toposolid type to be used by the new toposolid.
levelId:
Id of the level on which the toposolid is to be placed.
Returns:
A new toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point array size is less than 3.
-or-
The ElementId levelId is not a Level.
-or-
Toposolid type is not valid for this toposolid.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024

Autodesk.Revit.DB.Toposolid.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of toposolid within the project.
document:
The document in which the new toposolid is created.
profiles:
An array of planar curve loops that represent the profiles of the toposolid.
topoTypeId:
Id of the toposolid type to be used by the new toposolid.
levelId:
Id of the level on which the toposolid is to be placed.
Returns:
A new toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
The ElementId levelId is not a Level.
-or-
Toposolid type is not valid for this toposolid.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024

Autodesk.Revit.DB.Toposolid.SketchId
Returns id of the sketch.
Since:
2024

Autodesk.Revit.DB.Toposolid.HostTopoId
The host toposolid id of the current toposolid subdivision.
If the object is not a toposolid subdivision, hostTopoId will be InvalidElementId.
Since:
2024

Autodesk.Revit.DB.Toposolid
An object that represents a Toposolid within the Autodesk Revit project.
Since:
2024